package HomeWorks;

public class HW_1 {
//    سؤال ۱ (ساده – متغیر و عملگرها)
//
//    برنامه‌ای بنویس که:
//
//    دو عدد صحیح از کاربر بگیرد
//
//    جمع، تفریق، ضرب، تقسیم و باقیمانده (%) آن‌ها را چاپ کند
//
//    نکته: اگر عدد دوم صفر بود، تقسیم انجام نشود.










//
//            سؤال ۲ (شرط‌ها – if / else)
//
//    برنامه‌ای بنویس که نمره‌ی یک دانش‌آموز را از کاربر بگیرد و:
//
//    اگر نمره ≥ 90 → "A+"
//
//    اگر 80 تا 89 → "A"
//
//    اگر 70 تا 79 → "B"
//
//    اگر 60 تا 69 → "C"
//
//    کمتر از 60 → "Failed"
//
//    را چاپ کند.
//








//            سؤال ۳ (حلقه for)
//
//    برنامه‌ای بنویس که:
//
//    اعداد 1 تا 100 را چاپ کند
//
//    فقط عددهایی که بر 3 بخش‌پذیر هستند چاپ شوند
//
//    اگر عدد به 45 رسید، حلقه متوقف شود (break)
//















//    سؤال ۴ (switch)
//
//    برنامه‌ای بنویس که:
//
//    یک عدد از 1 تا 7 از کاربر بگیرد
//
//    با استفاده از switch نام روز هفته را چاپ کند
//
//    اگر عدد خارج از این بازه بود، "Invalid day" چاپ شود











//
//    سؤال ۵ (سخت‌تر – Scanner + while + try/catch)
//
//    برنامه‌ای بنویس که:
//
//    در یک حلقه while از کاربر نام، سن و شهر بگیرد
//
//    اطلاعات را به این شکل چاپ کند:
//
//    Hello Ali, you are 20 and you live in Kabul
//
//
//    اگر کاربر به‌جای سن، چیزی غیر از عدد وارد کرد، خطا مدیریت شود
//
//    اگر کاربر برای نام "q" وارد کرد، برنامه متوقف شود
}
