package HomeWorks;

public class HW_3 {
//    سؤال ۱ – چاپ عنصر آرایه
//
//    با توجه به آرایه‌ی زیر:
//
//    String [] colors2 = {"red","blue","pink","yellow","green","purple"};
//
//
//    سوال:
//    چطور می‌توان عنصر اول و آخر آرایه را چاپ کرد؟














//
//    سؤال ۲ – حلقه روی آرایه
//
//    با همان آرایه‌ی رنگ‌ها:
//
//    سوال:
//    با استفاده از یک حلقه for تمام رنگ‌ها را یک‌به‌یک در خط جدا چاپ کن.
//
















//            سؤال ۳ – مجموع و میانگین
//
//    با آرایه‌ی زیر:
//
//    int[] numbers ={2,4,5,-76,87,-9,6,66,7,7,88,4,2,2};
//
//
//    سوال:
//    محاسبه کن مجموع و میانگین عناصر آرایه چقدر است و میانگین را با ۲ رقم اعشار چاپ کن.
//


















//    سؤال ۴ – بیشینه و کمینه
//
//    با همان آرایه‌ی اعداد:
//
//    سوال:
//    عدد بزرگ‌ترین و کوچک‌ترین عنصر آرایه را پیدا کن و چاپ کن.
//




















//    سؤال ۵ – شرط روی آرایه
//
//    با همان آرایه‌ی اعداد:
//
//    سوال:
//    تعداد اعداد منفی در آرایه را بشمار و چاپ کن.
}
